content/posts/20200714183737-c.md
+++
title = "C++"
author = ["Daniel Biasiotto"]
draft = false
+++

## Cherno {#cherno}

Crash Course
Engine Developer


## Pointers {#pointers}

Integer che punta ad una locazione di memoria

type\*


## References {#references}

Simili ai puntatori, metodo sintattico per leggibilita'

-   Non sono vere e proprie variabili
-   Non possono essere cambiate una volta assegnate
-   Devono essere inizializzate

    type&amp;


## Classes {#classes}

Objected Oriented Programming `~` Uno stile di programmazione
C++ non impone OOP a differenza di Java

-   Privata di Default


## Structs {#structs}

Differenza (tecnica) con Classi: visibilita'

-   Pubblica di Default

Esiste per compatibilita' con C

L'uso si differenzia:
    si utilizza una struct quando si usa POD (plain old data)

-   utilizzato per definire strutture matematiche